Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.0.29/atdf/PIC32MZ1024EFG124.atdf
      <value-group caption="Deadman Timer enable bit" name="DEVCFG1__FDMTEN">
         <value caption="Deadman Timer is enabled and cannot be disabled by software" name="ON" value="0x1"/>
         <value caption="Deadman Timer is disabled and can be enabled by software" name="OFF" value="0x0"/>
      </value-group>
      <value-group caption="Background Debugger Enable bits" name="DEVCFG0__DEBUG">
         <value caption="Debugger is enabled" name="ON" value="0x0"/>
         <value caption="Debugger is disabled" name="OFF" value="0x3"/>
      </value-group>
      <value-group caption="JTAG Enable bit" name="DEVCFG0__JTAGEN">
         <value caption="JTAG Port Enabled" name="ON" value="0x1"/>
         <value caption="JTAG Disabled" name="OFF" value="0x0"/>
      </value-group>
      <value-group caption="In-Circuit Emulator/Debugger Communication Channel Select bits" name="DEVCFG0__ICESEL">
         <value caption="PGEC1/PGED1 pair is used" name="ICS_PGx1" value="0x3"/>
         <value caption="PGEC2/PGED2 pair is used" name="ICS_PGx2" value="0x2"/>
      </value-group>
      <value-group caption="Trace Enable bit" name="DEVCFG0__TRCEN">
         <value caption="Trace features in the CPU are enabled" name="ON" value="0x1"/>
         <value caption="Trace features in the CPU are disabled" name="OFF" value="0x0"/>
      </value-group>
      <value-group caption="Boot ISA Selection bit" name="DEVCFG0__BOOTISA">
         <value caption="Boot code and Exception code is MIPS32" name="MIPS32" value="0x1"/>
         <value caption="Boot code and Exception code is microMIPS" name="MICROMIPS" value="0x0"/>
      </value-group>
      <value-group caption="Dynamic Flash ECC Configuration bits" name="DEVCFG0__FECCCON">
         <value caption="Flash ECC is enabled (ECCCON bits are locked)" name="ON" value="0x0"/>
         <value caption="Dynamic Flash ECC is enabled (ECCCON bits are locked)" name="DYNAMIC" value="0x1"/>
         <value caption="ECC and Dynamic ECC are disabled (ECCCON bits are locked)" name="OFF_LOCKED" value="0x2"/>
         <value caption="ECC and Dynamic ECC are disabled (ECCCON bits are writable)" name="OFF_UNLOCKED" value="0x3"/>
      </value-group>
      <value-group caption="Flash Sleep Mode bit" name="DEVCFG0__FSLEEP">
         <value caption="Flash is powered down when the device is in Sleep mode" name="OFF" value="0x1"/>
         <value caption="Flash power down is controlled by the VREGS bit" name="VREGS" value="0x0"/>
      </value-group>
      <value-group caption="Debug Mode CPU Access Permission" name="DEVCFG0__DBGPER">
         <value caption="Allow CPU access to Permission Group 2 permission regions" name="ALLOW_PG2" value="0x4"/>
         <value caption="Allow CPU access to Permission Group 1 permission regions" name="ALLOW_PG1" value="0x2"/>
         <value caption="Allow CPU access to Permission Group 0 permission regions" name="ALLOW_PG0" value="0x1"/>
         <value caption="PG0: Allow PG1: Allow PG2: Deny" name="PG_1_0" value="0x3"/>
         <value caption="PG0: Allow PG1: Deny PG2: Allow" name="PG_2_0" value="0x5"/>
         <value caption="PG0: Deny PG1: Allow PG2: Allow" name="PG_2_1" value="0x6"/>
         <value caption="Allow CPU access to all permission regions" name="PG_ALL" value="0x7"/>
         <value caption="Deny CPU access to all permission regions" name="PG_NONE" value="0x0"/>
      </value-group>
      <value-group caption="Soft Master Clear Enable bit" name="DEVCFG0__SMCLR">
         <value caption="MCLR pin generates a normal system Reset" name="MCLR_NORM" value="0x1"/>
         <value caption="MCLR pin generates an emulated POR Reset" name="MCLR_POR" value="0x0"/>
      </value-group>
      <value-group caption="Secondary Oscillator Gain Control bits" name="DEVCFG0__SOSCGAIN">
         <value caption="Gain Level 3 (highest)" name="GAIN_LEVEL_3" value="0x3"/>
         <value caption="Gain Level 2" name="GAIN_LEVEL_2" value="0x2"/>
         <value caption="Gain Level 0 (lowest)" name="GAIN_LEVEL_0" value="0x0"/>
         <value caption="Gain Level 1" name="GAIN_LEVEL_1" value="0x1"/>
      </value-group>
      <value-group caption="Secondary Oscillator Boost Kick Start Enable bit" name="DEVCFG0__SOSCBOOST">
         <value caption="Boost the kick start of the oscillator" name="ON" value="0x1"/>
         <value caption="Normal start of the oscillator" name="OFF" value="0x0"/>
      </value-group>
      <value-group caption="Primary Oscillator Gain Control bits" name="DEVCFG0__POSCGAIN">
         <value caption="Gain level 3 (Highest)" name="GAIN_LEVEL_3" value="0x3"/>
         <value caption="Gain level 2" name="GAIN_LEVEL_2" value="0x2"/>
         <value caption="Gain level 1" name="GAIN_LEVEL_1" value="0x1"/>
         <value caption="Gain level 0 (Lowest)" name="GAIN_LEVEL_0" value="0x0"/>
      </value-group>
      <value-group caption="Primary Oscillator Boost Kick Start Enable bit" name="DEVCFG0__POSCBOOST">
         <value caption="Boost the kick start of the oscillator" name="ON" value="0x1"/>
         <value caption="Normal start of the oscillator" name="OFF" value="0x0"/>
      </value-group>
      <value-group caption="EJTAG Boot Enable bit" name="DEVCFG0__EJTAGBEN">
         <value caption="Normal EJTAG functionality" name="NORMAL" value="0x1"/>
         <value caption="Reduced EJTAG functionality" name="REDUCED" value="0x0"/>
      </value-group>
      <value-group caption="Code-Protect bit" name="DEVCP0__CP">
         <value caption="Protection Enabled" name="ON" value="0x0"/>
         <value caption="Protection Disabled" name="OFF" value="0x1"/>
      </value-group>
      <value-group caption="Boot Flash True Sequence Number bits" name="SEQ3__TSEQ">
         <value caption="Boot Flash True Sequence Number" name=""/>
      </value-group>
      <value-group caption="Boot Flash Complement Sequence Number bits" name="SEQ3__CSEQ">
         <value caption="Boot Flash Complement Sequence Number" name=""/>
      </value-group>
   </module>
   <module caption="" id="02508" name="ADCHS" version="1">
      <register-group name="ADCHS">
         <register caption="ADC Control Register 1" name="ADCCON1" initval="0x00601000" offset="0x0" rw="RW" size="4">
            <bitfield mask="0x00000007" name="DMABL"/>
            <bitfield caption="Scan Trigger High Level/Positive Edge Sensitivity bit" mask="0x00000008" name="STRGLVL" values="ADCCON1__STRGLVL"/>
            <bitfield caption="Interrupt Vector Shift bits" mask="0x00000070" name="IRQVS" values="ADCCON1__IRQVS"/>
            <bitfield caption="Fast Synchronous Peripheral Clock to ADC Control Clock bit" mask="0x00000200" name="FSPBCLKEN" values="ADCCON1__FSPBCLKEN"/>
            <bitfield caption="Fast Synchronous System Clock to ADC Control Clock bit" mask="0x00000400" name="FSSCLKEN" values="ADCCON1__FSSCLKEN"/>
            <bitfield caption="Capacitive Voltage Division Enable bit" mask="0x00000800" name="CVDEN" values="ADCCON1__CVDEN"/>
            <bitfield caption="Analog Input Charge Pump Enable bit - see datasheet" mask="0x00001000" name="AICPMPEN" values="ADCCON1__AICPMPEN"/>
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="ADCCON1__SIDL"/>
            <bitfield caption="ADC Module Enable bit" mask="0x00008000" name="ON" values="ADCCON1__ON"/>
            <bitfield caption="Scan Trigger Source Select bits" mask="0x001F0000" name="STRGSRC" values="ADCCON1__STRGSRC"/>
            <bitfield caption="Shared ADC Resolution bits" mask="0x00600000" name="SELRES" values="ADCCON1__SELRES"/>
            <bitfield caption="Fractional Data Output Format bit" mask="0x00800000" name="FRACT" values="ADCCON1__FRACT"/>
            <bitfield caption="Turbo Slave ADCx bits" mask="0x07000000" name="TRBSLV" values="ADCCON1__TRBSLV"/>
            <bitfield caption="Turbo Master ADCx bits" mask="0x38000000" name="TRBMST" values="ADCCON1__TRBMST"/>
            <bitfield caption="Turbo Channel Error Status bit" mask="0x40000000" name="TRBERR" values="ADCCON1__TRBERR"/>
            <bitfield caption="Turbo Channel Enable bit" mask="0x80000000" name="TRBEN" values="ADCCON1__TRBEN"/>
         </register>
